{
  "main": {
    "name": "Darian Evans-Cintron Portfolio",
    "description": "I am a full stack development engineer and I use java, react, angular and node.js to develop pages, applications and APIs. This project is my resume and portfolio home page ",
    "bio": "I am a seasoned Full Stack Developer with 3 years of hands-on experience in crafting robust and scalable applications.My expertise spans a diverse technology stack, showcasing proficiency in Java, Spring Boot, React, Angular, Bootstrap, MSSQL, PostGreSQL, and Google Cloud Platform. My journey in the tech world has equipped me with the skills to seamlessly integrate frontend and backend technologies, ensuring a holistic and efficient development process. Whether it's creating dynamic and responsive user interfaces with React, implementing server-side logic with Java and Spring Boot, or managing databases on MSSQL and PostgreSQL, I am dedicated to delivering top-notch solutions.",
    "image": "profilepic.jpg",
    "contactmessage": "Please contact me for any software development opportunities ",
    "email": "darian.janelle.evans@gmail.com",
    "phone": "248-904-9663",
    "github": "https://github.com/djevans87",
    "project": "https://github.com/djevans87/resume-landing-lage",
    "address": {
      "street": "3802 Cherrywood ln",
      "city": "Rochester Hills",
      "state": "MI",
      "zip": "48309"
    },
    "website": "",
    "resumedownload": "http://localhost:3000/DarianEvansCintronResume.pdf",
    "social": [
      {
        "name": "twitter",
        "url": "https://twitter.com/darianevans87",
        "className": "fa fa-twitter"
      },
      {
        "name": "linkedin",
        "url": "https://www.linkedin.com/in/darian-evans/",
        "className": "fa fa-linkedin"
      },
      {
        "name": "github",
        "url": "https://github.com/djevans87",
        "className": "fa fa-github"
      }
    ]
  },
  "resume": {
    "skillmessage": "I possess a Google Cloud Certification and expertise in Java, SQL, TypeScript, JavaScript, HTML, CSS, Windows, Linux (CentOS, Ubuntu), Android, iOS, MySQL, PostgreSQL, Postman, IntelliJ, Webstorm, Git, Pivotal Cloud Foundry, Jenkins, Tekton, Docker, Sonarqube, 42Crunch, Fossa, Checkmarx, Spring Boot, Node.js, Angular.js, React.js, Bootstrap, and Google Cloud Services (BigQuery, Cloud Storage, Cloud SQL, Dataflow-Apache Beam, Cloud Run).",
    "education": [
      {
        "school": "Baker College",
        "degree": "Bachelors in Business Administration ",
        "graduated": "March 2023",
        "description": "Accelerated Program, BBA. I gained an understanding of business processes, strategy, and objectives that allow me to align with projects and business goals. I have data analysis, financial literacy, risk and project management skills that can be applied in collaboration with developing software projects. "
      },
      {
        "school": "Baker College",
        "degree": "Associates in Information Technology",
        "graduated": "May 2019",
        "description": "I gained foundational skills in systems administration, networking, cybersecurity, and problem-solving, essential for  roles in IT support and technical environments."
      }
    ],
    "work": [
      {
        "company": "Ford Motor Credit Company",
        "title": "Software Engineer",
        "location": "Dearborn, MI",
        "years": "Nov 2021- Present",
        "description": "Reduced technical debt by consolidating APIs for Enterprise utilization. Worked with a variety of environments and languages, learning required skills for full-stack application development and security.",
        "projects": [
          {
            "name": "Payment Walk Project",
            "technologies": ["Spring Boot", "Angular", "MSSQL"],
            "responsibilities": [
              "Collaborated with a 10-member agile team developing internal solutions for Marketing teams.",
              "Reduced a 5-6 week manual process to a 3-day batch process with a user interface.",
              "Coordinated migration from on-prem deployment in Pivotal Cloud Foundry to Google Cloud CI/CD pipeline using Apache Beam, Dataflow, Cloud Storage, and BigQuery.",
              "Implemented JWT Validation method using OAuth2 security.",
              "Independently created a User Management Service using Angular component, EventEmitter, Material Table, and Dialog functionality.",
              "Enhanced Angular UI components with a team of 5 other developers."
            ]
          },
          {
            "name": "Foundational Dashboard Project",
            "technologies": ["Spring Boot", "React", "PostgreSQL"],
            "responsibilities": [
              "Collaborated with a 3-member Agile team developing an Ad Hoc report filtering system with a UI.",
              "Created a centralized location for Customer Information not previously available directly.",
              "Removed the need to contact third-party vendors and reduced a several days process to instantaneous.",
              "Independently designed grid template structure to easily add multiple filter cards."
            ]
          },
          {
            "name": "Customer Insights Project",
            "technologies": ["Spring Boot", "Apigee"],
            "responsibilities": [
              "Implemented ADFS security authorization.",
              "Independently created a cron scheduler function to ingest data from Google Cloud.",
              "Enhanced API components with a team of 5 other developers to ingest Customer Data from 4 different sources to a centralized location."
            ]
          }
        ]
      },
      {
        "company": "Edward Rose & Sons",
        "title": "Enterprise Software Support Specialist",
        "location": "Bloomfield Hills, MI",
        "years": "Nov 2019- Nov 2021",
        "description": "As a software support specialist, I worked directly with business owners to help build and maintain business solutions. I also assisted on the Helpdesk, helping to troubleshoot employee technical issues.",
        "projects": [
          {
            "name": "I.T Helpdesk Support",
            "technologies": [
              "FreshService",
              "Active Directory",
              "Microsoft Management Console"
            ],
            "responsibilities": [
              "Provided customer software support for 3,000+ employees via phone, email, and remote desktop.",
              "FreshService ticket resolution and knowledge base documentation",
              "Monitored, updated, and resolved User Management requests efficiently and quickly utilizing Active Directory.",
              "Established, administered, and maintained training documentation for both technicians and non-technical end users.",
              "Developed and implemented onboarding training for IT employees - technical operations and enterprise software support.",
              "Investigated and maintained database accuracy of all residential information utilizing SQL queries.",
              "Established and managed corporate policies."
            ]
          },
          {
            "name": "Yardi Support Specialist",
            "technologies": [
              "Yardi",
              "Yardi CRM",
              "SmartRent",
              "REBA BI",
              " PowerBI",
              "SQL"
            ],
            "responsibilities": [
              "Investigated and maintained database accuracy of all residential information utilizing SQL queries.",
              "Established and managed corporate policies.",
              "Consolidated data from multiple systems of record into one single source.",
              "Created data analytic dashboards and automated reports for stakeholders.",
              "Created and maintained property information in relational databases."
            ]
          }
        ]
      },
      {
        "company": "Credit Union ONE",
        "title": "IT Support Specialist",
        "location": "Ferndale, MI",
        "years": "Sep 2017- Nov 2019",
        "description": "Delivered technical support for 20 branches via phone, email, remote desktop, skype chat, and in person. Orchestrated a full companywide migration to Windows 10 and created/maintained documentation for internal IT solutions and employee user Knowledge Base.",
        "projects": [
          {
            "name": "I.T Helpdesk Support",
            "technologies": ["Spring Boot", "Angular", "MSSQL"],
            "responsibilities": [
              "Delivered technical support for 20 branches via phone, email, remote desktop, skype chat, and in person.",
              "Consistently met SLAs for closing tickets and call times. Averaging 20-25 calls a day and closing 30-40 tickets.",
              "Orchestrated a full companywide migration to Windows 10.",
              "Created and maintained documentation for both internal IT solutions and employee user Knowledge Base for front end users."
            ]
          }
        ]
      }
    ],
    "skills": [
      {
        "name": "JAVA",
        "level": "90%"
      },

      {
        "name": "ReactJs",
        "level": "90%"
      },
      {
        "name": "VueJs",
        "level": "35%"
      },
      {
        "name": "CSS",
        "level": "90%"
      },
      {
        "name": "SQL",
        "level": "85%"
      },
      {
        "name": "Angular",
        "level": "75%"
      },
      {
        "name": "PHP",
        "level": "45%"
      },
      {
        "name": "Python",
        "level": "10%"
      }
    ]
  },
  "portfolio": {
    "projects": [
      {
        "id": 1,
        "title": "RetroPi: Raspberry Pi Gaming Emulator",
        "category": "A video game emulator I built containing 200 classic video games from Nintendo, SNES, N-64, and Sega",
        "image": "01.jpg",
        "url": ""
      },
      {
        "id": 2,
        "title": "Intrusion Detection System: Raspberry Pi",
        "category": "A small motion detection system that notifies user via sms of detection, along with small video captures",
        "image": "02.jpg",
        "url": ""
      },
      {
        "id": 3,
        "title": "CodeCademy Full-Stack Engineer Development Plan ",
        "category": "An avenue for continued learning for Software Development",
        "image": "03.jpg",
        "url": ""
      },
      {
        "id": 4,
        "title": "Resume Website",
        "category": "A React based resume website to showcase my experience",
        "image": "04.jpg",
        "url": ""
      }
    ]
  }
}
